In [1]:
import pandas as pd
from pandas import DataFrame

### 131. 데이터프레임 생성 (컬럼 단위)

다음 표와 같은 데이터프레임을 생성하세요. 이때 컬럼 단위로 raw 데이터를 표현해서 데이터프레임을 생성해보세요.

이름	나이	직책  
김은수	35	과장  
박정민	30	대리  
이하나	28	대리

In [2]:
DataFrame({'이름': ['김은수', '박정민', '이하나'],
          '나이': [35, 30, 28],
          '직책': ['과장', '대리', '대리']})

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

### 132. 데이터프레임 생성 (2차원 리스트)

다음 표와 같은 데이터프레임을 생성하세요. 이때 데이터 부분을 2차원 리스트로 표현하고 컬럼명은 명시적으로 인자로 전달하는 방식으로 생성해보세요.

이름	나이	직책  
김은수	35	과장  
박정민	30	대리  
이하나	28	대리

In [5]:
columns = ['이름', '나이', '직책']
values = [['김은수', 35, '과장'], ['박정민', 30, '대리'], ['이하나', 28, '대리']]

DataFrame(values, columns=columns)

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

### 133. 데이터프레임 생성 (딕셔너리 리스트)

다음 표와 같은 데이터프레임을 생성하세요. 이때 각 행에 대해서 딕셔너리로 표현하고 이를 리스트로 담아서 데이터프레임 생성자에 전달하세요.

이름	나이	직책  
김은수	35	과장  
박정민	30	대리  
이하나	28	대리

In [6]:
DataFrame({'이름': ['김은수', '박정민', '이하나'],
          '나이': [35, 30, 28],
          '직책': ['과장', '대리', '대리']})

    이름  나이  직책
0  김은수  35  과장
1  박정민  30  대리
2  이하나  28  대리

### 134. 데이터프레임 인덱스 설정

다음 데이터프레임에서 종목코드 컬럼을 인덱스로 설정하세요. 그리고 인덱스의 name 속성을 "종목코드"로 설정하세요.

data = [  
    ["037730", "3R", 1510, 7.36],  
    ["036360", "3SOFT", 1790, 1.65],  
    ["005760", "ACTS", 1185, 1.28],  
]  
columns = ["종목코드", "종목명", "현재가", "등락률"]  
df = pd.DataFrame(data=data, columns=columns)

In [10]:
data = [
    ["037730", "3R", 1510, 7.36],
    ["036360", "3SOFT", 1790, 1.65],
    ["005760", "ACTS", 1185, 1.28],
]
columns = ["종목코드", "종목명", "현재가", "등락률"]
df = pd.DataFrame(data=data, columns=columns)

df.set_index('종목코드', inplace=True)

In [11]:
df

          종목명   현재가   등락률
종목코드
037730     3R  1510  7.36
036360  3SOFT  1790  1.65
005760   ACTS  1185  1.28

### 135. data, index, columns

다음과 같이 데이터가 있을 때 데이터프레임 객체를 생성하세요.

import pandas as pd

index = ["037730", "036360", "005760"]  
data = [["3R", "1510"],  
         ["3SOFT", 1790],  
         ["ACTS", 1185]]  
columns = ["종목명", "현재가"]

In [12]:
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]

DataFrame(data, index=index, columns=columns)

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

### 136. numpy reshape

넘파이의 arange와 reshape을 사용하여 다음 데이터프레임을 생성하세요.

In [13]:
import numpy as np

arr = np.arange(8)
arr

array([0, 1, 2, 3, 4, 5, 6, 7])

In [15]:
arr = arr.reshape(2, 4)
arr

array([[0, 1, 2, 3],
       [4, 5, 6, 7]])

In [16]:
pd.DataFrame(arr)

   0  1  2  3
0  0  1  2  3
1  4  5  6  7

### 137. reset_index

다음 데이터프레임에서 인덱스를 컬럼으로 변경하세요.

import pandas as pd

index = ["037730", "036360", "005760"]  
data = [["3R", "1510"],  
         ["3SOFT", 1790],  
         ["ACTS", 1185]]  
columns = ["종목명", "현재가"]  
df = pd.DataFrame(data=data, index=index, columns=columns)

In [17]:
index = ["037730", "036360", "005760"]
data = [["3R", "1510"],
         ["3SOFT", 1790],
         ["ACTS", 1185]]
columns = ["종목명", "현재가"]
df = pd.DataFrame(data=data, index=index, columns=columns)

df

          종목명   현재가
037730     3R  1510
036360  3SOFT  1790
005760   ACTS  1185

In [18]:
df.reset_index()

    index    종목명   현재가
0  037730     3R  1510
1  036360  3SOFT  1790
2  005760   ACTS  1185

### 138. index

위 데이터프레임의 인덱스를 출력하세요.

In [19]:
df.index

Index(['037730', '036360', '005760'], dtype='object')

### 139. DataFrame.columns

위 데이터프레임의 컬럼을 출력하세요.

In [20]:
df.columns

Index(['종목명', '현재가'], dtype='object')

### 140. DataFrame dtype

다음 데이터를 부호가 없는 8비트 정수 데이터 타입을 갖는 데이터프레임 객체로 생성하세요.

d = {'col1': [1, 2], 'col2': [3, 4]}

In [25]:
d = {'col1': [1, 2], 'col2': [3, 4]}

df = DataFrame(d, dtype=np.int8)

df.dtypes

col1    int8
col2    int8
dtype: object